Revit 2024 API
ScheduleDefinition.FamilyId Property
 In a note block schedule, the ID of the Generic Annotation family displayed by the schedule.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public ElementId FamilyId { get; }
Visual Basic
Public ReadOnly Property FamilyId As ElementId
	Get
Visual C++
public:
property ElementId^ FamilyId {
	ElementId^ get ();
}
Remarks
 A note block is a schedule of the Generic Annotations category that shows elements of a single family rather than all elements in the category.
See Also
ScheduleDefinition Class
Autodesk.Revit.DB Namespace